app/controllers/articles_controller.rb

  def index
    @articles = Article.all #this action will list all of our articles.
  end
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(params.require(:article).permit(:title, :text))

    @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ke"], ["text", "Batista\r\n"], ["created_at", "2015-12-04 03:09:49.208595"], ["updated_at", "2015-12-04 03:09:49.208595"]]